### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-18T04:31:05.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:43",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:33" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:33/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip" -> "lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip"
!       s3_object_version              = "SgYc894rV5o12Qny4DIX9_ToUI.GQRxT" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "33" -> (known after apply)
        # (18 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "33" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "519e806c068cb3f343037e75b052bf2f" -> (known after apply)
!       id                     = "lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip" -> (known after apply)
!       key                    = "lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip" -> "lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "./.terraform/lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip" -> "./.terraform/lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "SgYc894rV5o12Qny4DIX9_ToUI.GQRxT" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "zip",
+                       "./dist/src",
+                       null,
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "1975935443715449202" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip" -> "./.terraform/lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip"
!           "timestamp" = "1692332991301385000" -> "1692377943015083000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "8944461188387261973" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip" -> "./.terraform/lambda-builds/451081869291f14469eada5864eaa0687be508b226c5beb5414bbab52ac0012e.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
!                       path     = "./app" -> "./dist/src"
-                       patterns = [
-                           "!app/.+",
                        ]
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:43" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-18T04:30:55.929+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:43" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/c0b0989e08f313d4560b84c9d5e2deeac65cd346658f8ab413291513cf145816.zip" -> "builds/1a209942b814defef53e4afaff1fcd7c502272714be3f4ab79325a4ae10a911e.zip"
!       s3_object_version           = "x2Chd6PPVvHSKZz3dSXemlkimwObDgIN" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "DF071IZU1cm9LELBNu+uZp4RFMA688ZBd2hS6u1R/+0=" -> (known after apply)
!       source_code_size            = 29720177 -> (known after apply)
!       version                     = "43" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "bfae73ecd13bb407d2352601bd78724f-6" -> (known after apply)
!       id                     = "builds/c0b0989e08f313d4560b84c9d5e2deeac65cd346658f8ab413291513cf145816.zip" -> (known after apply)
!       key                    = "builds/c0b0989e08f313d4560b84c9d5e2deeac65cd346658f8ab413291513cf145816.zip" -> "builds/1a209942b814defef53e4afaff1fcd7c502272714be3f4ab79325a4ae10a911e.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/c0b0989e08f313d4560b84c9d5e2deeac65cd346658f8ab413291513cf145816.zip" -> "builds/1a209942b814defef53e4afaff1fcd7c502272714be3f4ab79325a4ae10a911e.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "x2Chd6PPVvHSKZz3dSXemlkimwObDgIN" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/1a209942b814defef53e4afaff1fcd7c502272714be3f4ab79325a4ae10a911e.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/1a209942b814defef53e4afaff1fcd7c502272714be3f4ab79325a4ae10a911e.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "4963148782804248377" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/c0b0989e08f313d4560b84c9d5e2deeac65cd346658f8ab413291513cf145816.zip" -> "builds/1a209942b814defef53e4afaff1fcd7c502272714be3f4ab79325a4ae10a911e.zip"
!           "timestamp" = "1692332993024390000" -> "1692377944612490800"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "2129699978447968392" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/c0b0989e08f313d4560b84c9d5e2deeac65cd346658f8ab413291513cf145816.zip" -> "builds/1a209942b814defef53e4afaff1fcd7c502272714be3f4ab79325a4ae10a911e.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 8 to destroy.
```
</details>